/*
答案：
成功：12+34+56+7-8+9 = 110
成功：12+3+45+67-8-9 = 110
成功：12-3+4-5+6+7+89 = 110
成功：1+2+34+5+67-8+9 = 110
成功：1-2+3+45-6+78-9 = 110
成功：123+4-5-6-7-8+9 = 110
成功：123-4+5-6-7+8-9 = 110
成功：123-4-5+6+7-8-9 = 110
成功：123+4+5+67-89 = 110
成功：1+234-56-78+9 = 110
*/

#include <stdio.h>
#include <stdlib.h>
int b[10];
void dd(long x,int z,long y,int n)
{    int i,q,fh,h;
     if(n==10)
     {  if(z==0) q=x+y; else q=x-y;
        if(q==110) { for(i=2;i<10;i++) printf(" %d",b[i]); printf("\n"); }
      }
     
     if(n<10)
     for(i=0;i<3;i++)
     {  b[n]=i;
        if(i!=2){ if(z==0) q=x+y; else q=x-y; fh=i;h=n;}
        if(i==2) { q=x; fh=z; h=y*10+n; }
        dd(q,fh,h,n+1);
      }
    }

 void main()
{ dd(0,0,1,2);}  
//输出数据，零为+，一为减，二位空格 
