/*
从键盘输入一个整数（1~20）
则以该数字为矩阵的大小，把1,2,3…n*n 的数字按照顺时针螺旋的形式填入其中。例如：
输入数字2，则程序输出：
1 2
4 3
输入数字3，则程序输出：
1 2 3
8 9 4
7 6 5
输入数字4， 则程序输出：
1  2   3   4
12  13  14  5
11  16  15  6
10   9  8   7

解法一 （边界判断法，外部判断是否大于n或小于0，内部判断是否不等于零，所以先将数组清零） 
解法二 如下 
*/
#include<stdio.h>
main()
{
	int n,a[10][10]={0};
	static int i=0,j=0;
	static int st=0,sp=0;
	static int num=1;
	int x,y;
	scanf("%d",&n);
	//坐标+1还是-1进行分组（第一组特殊处理）
	for(x=2*n-1;x!=-1;x=x-2)					 
	{
		for(y=1;y<=x;y++)
		{
			//跳过第一组缺省的一个数 
			if(sp==0)
			y++;
			sp++;
			//前一半多一个为列标，剩余为行标；开关st判断坐标增减，偶数为增，奇数为减 
			if(y<=(x+1)/2&&st%2==0)
			{
				a[i][j]=num++;
				j++;
			}
			else if(y>(x+1)/2&&st%2==0)
			{
				a[i][j]=num++;
				i++;	
			}
			else if(y<=(x+1)/2&&st%2==1)
			{
				a[i][j]=num++;
				j--;
			}
			else if(y>(x+1)/2&&st%2==1)
			{
				a[i][j]=num++;
				i--;
			}
		}
		st++;
	}
	a[i][j]=num;
	for(x=0;x<n;x++)
	{
		for(y=0;y<n;y++)
		{
			printf("%2d ",a[x][y]);
		}
		printf("\n");
	}
	return 0;
}